Repository: BozoDel/LoveKnowsNoBorders-PT
Catalog: lovePT-level2.tmx
Source language: en_us
Languages: pt_br

source: function love.draw() love.graphics.push() -- stores the coordinate system love.graphics.scale(0.5, 0.5) -- reduce everything by 50% in both X and Y coordinates love.graphics.print("Scaled text", 50, 50) -- print half-sized text at 25x25 love.graphics.pop() -- return to stored coordinated love.graphics.print("Normal text", 50, 50) end
pt_br: function love.draw() love.graphics.push() -- salva o sistema de coordenadas love.graphics.scale(0.5, 0.5) -- reduz tudo em 50% tanto em X como em Y love.graphics.print("Texto redimensionado", 50, 50) -- imprime texto com metade do tamanho em 25x25 love.graphics.pop() -- retorna às coordenadas salvas love.graphics.print("Texto normal", 50, 50) end

source: They affect [[love.graphics.clear]] and [[Canvas:clear]] as well.
pt_br: Também afeta [[love.graphics.clear (Português)|love.graphics.clear]] e [[Canvas:clear (Português)|Pintura:clear]].

source: size (1000)
pt_br: tamanho (1000)

source: The top-left position along the y-axis.
pt_br: A posição superior esquerda ao longo do eixo y.

source: The number of segments used for drawing the circle.
pt_br: O número de segmentos usados para desenhar o circulo.

source: A numerical indexed table with the red, green and blue values as [[number]]s.
pt_br: Uma tabela com índice numérico com os valores de vermelho, verde e azul como [[number (Português)|números]].

source: * [[Image]]
pt_br: * [[Image (Português)|Imagem]]

source: True if there is a file or directory with the specified name. False otherwise.
pt_br: Verdadeiro se existir um arquivo ou diretório com o nome especificado, senão, falso.

source: love.graphics.setLineStyle( style )
pt_br: love.graphics.setLineStyle( estilo )

source: The new FileData, or nil if an error occurred.
pt_br: O novo DadoDeArquivo, ou nil, se tiver ocorrido um erro.

source: Creates a new [[Source]] from a file, [[SoundData]], or [[Decoder]].
pt_br: Cria uma nova [[Source (Português)|Fonte]] a partir de um arquivo, [[SoundData (Português)|DadoDeSom]], ou [[Decoder (Português)|Decodificador]].

source: Returns
pt_br: Retorna

source: LineJoin
pt_br: JunçãoDeLinha

source: * [[ FileData]]
pt_br: * [[ FileData (Português)|DadoDeArquivo]]

source: * [[FilterMode]]
pt_br: * [[FilterMode (Português)|ModoDeFiltragem]]

source: Clears the event queue.
pt_br: Limpa a fila de eventos.

source: Resumes all audio.
pt_br: Despausa todo o áudio.

source: Draw some text with default font, 18px
pt_br: Desenha algum texto com a fonte padrão, 18px

source: A PixelEffect contains at least one function, named effect , which is the effect itself, but it can contain additional functions.
pt_br: Um EfeitoDePixel contém pelo menos uma função, chamada effect , que é o efeito em si, mas ele pode conter funções adicionais.

source: Returns the distance attenuation model.
pt_br: Retorna o modelo de atenuação por distância.

source: The vertex shader code, or a filename pointing to a file with the code.
pt_br: O código do shader de vértice, ou um nome de arquivo apontando para um arquivo com o código.

source: Gets the current point style.
pt_br: Obtém o estilo de ponto atual.

source: * [[love.graphics.setColorMask]]
pt_br: * [[love.graphics.setColorMask (Português)|love.graphics.setColorMask]]

source: Checking for events in 0.7.2
pt_br: Procurando eventos no 0.7.2

source: sy (sx)
pt_br: ey (ex)

source: See additional notes in [[love.graphics.print]].
pt_br: Veja notas adicionais em [[love.graphics.print (Português)|love.graphics.print]].

source: The new mesh.
pt_br: A nova malha.

source: Increase the point size by 1 and set it to smooth.
pt_br: Aumentar o tamanho de ponto em 1 e definir como smooth (suave)

source: It has been merged into [[love.graphics.draw]]
pt_br: Foi fundido com [[love.graphics.draw]]

source: Path to the file.
pt_br: Caminho do arquivo.

source: font = love.graphics.newFont( size )
pt_br: fonte = love.graphics.newFont( tamanho )

source: Gets information about the system's video card and drivers.
pt_br: Obtém informações sobre a placa de vídeo e os drivers do sistema.

source: Third event argument.
pt_br: Terceiro argumento do evento.

source: contents
pt_br: conteudo

source: Create a shader using vertex and pixel shader code which behaves as if no shader is set.
pt_br: Criar um shader usando código de shaders de vértice e de pixel que se comporta como se não houvesse shader.

source: * [[ Canvas]]
pt_br: * [[ Canvas (Português)|Pintura]]

source: texture (nil)
pt_br: textura (nil)

source: The source on which to resume the playback.
pt_br: A fonte que se deseja despausar.

source: Render alpha component.
pt_br: Renderizar componente alfa.

source: spriteBatch
pt_br: loteDeSprites

source: -- draw colored square to framebuffer love.graphics.setRenderTarget(framebuffer) love.graphics.setColor(230,240,120) love.graphics.rectangle('fill',0,0,100,100) love.graphics.setRenderTarget() -- draw scaled framebuffer to screen love.graphics.setColor(255,255,255) love.graphics.draw(framebuffer, 200,100, 0, .5,.5)
pt_br: -- desenhar quadradado colorido no framebuffer love.graphics.setRenderTarget(framebuffer) love.graphics.setColor(230,240,120) love.graphics.rectangle('fill',0,0,100,100) love.graphics.setRenderTarget() -- desenhar framebuffer redimensionado na tela love.graphics.setColor(255,255,255) love.graphics.draw(framebuffer, 200,100, 0, .5,.5)

source: It's possible to abort the exit process with the [[love.quit]] callback.
pt_br: É possível abortar o processo de saída com o callback [[love.quit (Português)|love.quit]].

source: It is recommended to set your game's identity first in your [[Config Files|conf.lua]] .
pt_br: É recomendado primeiro definir a identidade do seu jogo nos [[conf.lua (Português)|Arquivos de Configuração]] .

source: Gets the color mode (which controls how images are affected by the current color).
pt_br: Obtém o modo de cor (que controla como as imagens são afetadas pela cor atual).

source: Creates a new Rasterizer.
pt_br: Cria um novo Rasterizador.

source: green
pt_br: verde

source: The Rasterizer containing the font.
pt_br: O Rasterizador que contém a fonte.

source: The filename of the file. (Note that ':' may not occur in a filename.)
pt_br: O nome do arquivo. (Repare que ":" não deve ocorrer em um nome de arquivo.)

source: The shear factor on the x-axis.
pt_br: O fator de inclinação do eixo x.

source: The y axis is vertical: larger values are further towards the bottom.
pt_br: O eixo y é vertical: valores maiores são mais para baixo.

source: path
pt_br: caminho

source: FileMode
pt_br: ModoDeArquivo

source: alpha
pt_br: alfa

source: This is a low-level function, and is usually not called by the user, but by [[love.run]] .
pt_br: Esta é uma função de baixo nível, e normalmente não é chama pelo usuário, e sim por [[love.run (Português)|love.run]] .

source: mag
pt_br: amp

source: min, mag, anisotropy = love.graphics.getDefaultFilter( )
pt_br: red, amp, anisotropia = love.graphics.getDefaultFilter( )

source: DistanceModel
pt_br: ModeloDeDistância

source: A table of point positions, as described above.
pt_br: Uma tabela com as posições dos pontos, como descrito acima.

source: * [[love.graphics.getPointSize]]
pt_br: * [[love.graphics.getPointSize (Português)|love.graphics.getPointSize]]

source: A new ParticleSystem.
pt_br: Um novo SistemaDePartículas.

source: x = 100 y = 100 width = 100 height = 50 function love.draw() love.graphics.translate(x, y) local t = love.timer.getTime() love.graphics.shear(math.cos(t), math.cos(t * 1.3)) love.graphics.rectangle('fill', 0, 0, width, height) end
pt_br: x = 100 y = 100 largura = 100 altura = 50 function love.draw() love.graphics.translate(x, y) local t = love.timer.getTime() love.graphics.shear(math.cos(t), math.cos(t * 1.3)) love.graphics.rectangle('fill', 0, 0, largura, altura) end

source: You can change the position, scale, and even rotation in this way.
pt_br: Dessa maneira você pode mudar a posição, a escala e até a rotação.

source: The source on which to stop the playback
pt_br: A fonte que deve parar de tocar

source: The position of third point on the y-axis.
pt_br: A posição do terceiro ponto no eixo y.

source: Gets the [[BlendMode|blending mode]].
pt_br: Obtém o [[BlendMode (Português)|modo de mistura]].

source: model
pt_br: modelo

source: The name of the file.
pt_br: O nome do arquivo.

source: The directory must be empty before removal or else it will fail.
pt_br: O diretório deve estar vazio antes da remoção, senão a função vai falhar.

source: A [[sequence]] with the names of all files and subdirectories as strings.
pt_br: Uma [[sequence (Português)|sequência]] com os nomes de todos arquivos e subdiretórios como strings.

source: Whether the blue color component is active when rendering.
pt_br: Se o componente de cor azul é ativo ou não ao renderizar.

source: files = love.filesystem.getDirectoryItems( dir, callback )
pt_br: arquivos = love.filesystem.getDirectoryItems( dir, callback )

source: is_file = love.filesystem.isFile( filename )
pt_br: eh_arquivo = love.filesystem.isFile( nomeDoArquivo )

source: Sets the line width.
pt_br: Configura a espessura da linha.

source: image = love.graphics.newImage( filename )
pt_br: imagem = love.graphics.newImage( nomeDoArquivo )

source: -- giving the coordinates directly love.graphics.polygon('fill', 100, 100, 200, 100, 150, 200) -- defining a table with the coordinates -- this table could be built incrementally too local vertices = {100, 100, 200, 100, 150, 200} -- passing the table to the function as a second argument love.graphics.polygon('fill', vertices)
pt_br: -- passando as coordenadas diretamente love.graphics.polygon('fill', 100, 100, 200, 100, 150, 200) -- definindo uma tabela com as coordenadas -- esta tabela também pode ser construída através de incrementos local vertices = {100, 100, 200, 100, 150, 200} -- passando a tabela para a função como segundo argumento love.graphics.polygon('fill', vertices)

source: More canvases.
pt_br: Mais pinturas.

source: * [[Canvas]]
pt_br: * [[Canvas (Português)|Pintura]]

source: * [[ Quad]]
pt_br: * [[ Quad (Português)|Quad]]

source: Defines or releases a stencil.
pt_br: Define ou retira um estêncil.

source: * [[love.graphics.setCanvas]]
pt_br: * [[love.graphics.setCanvas (Português)|love.graphics.setCanvas]]

source: It has been renamed to [[love.graphics.setDefaultFilter]]
pt_br: Foi renomeado para [[love.graphics.setDefaultFilter (Português)|love.graphics.setDefaultFilter]]

source: Squish a rectangle
pt_br: Achatar um retângulo

source: e = love.filesystem.exists( filename )
pt_br: e = love.filesystem.exists( nomeDoArquivo )

source: Returns a table with the names of files and subdirectories in the specified path.
pt_br: Retorna uma tabela com os nomes de arquivos e subdiretórios do caminho especificado.

source: If you are getting the error message "Could not set write directory", try setting the save directory.
pt_br: Se você receber a mensagem de erro "Could not set write directory" (impossível definir diretório de escrita), tente configurar o diretório de escrita.

source: vertex shader code
pt_br: código do shader de vértice

source: The position on the y-axis.
pt_br: A posição no eixo y.

source: Note: when in fill mode, the polygon must be [http://en.wikipedia.org/wiki/Convex_polygon convex] and [http://en.wikipedia.org/wiki/Simple_polygon simple] or rendering artifacts may occur.
pt_br: Nota: quando no modo fill , o polígono deve ser [http://en.wikipedia.org/wiki/Convex_polygon convexo] e [http://en.wikipedia.org/wiki/Simple_polygon simples] ou poderão ocorrer artefatos de renderização.

source: Increase the point size by 1, by using [[love.graphics.getPointSize]].
pt_br: Aumentar o tamanho de ponto em 1 usando [[love.graphics.getPointSize (Português)|love.graphics.getPointSize]].

source: data = love.filesystem.newFileData( contents, name, decoder )
pt_br: dado = love.filesystem.newFileData( conteudo, nome, decodificador )

source: code
pt_br: codigo

source: It's the same as [[love.graphics.setStencil]] with the mask inverted.
pt_br: É o mesmo que [[love.graphics.setStencil (Português)|love.graphics.setStencil]] com a máscara invertida.

source: Sets the color mode (which controls how images are affected by the current color).
pt_br: Configura o modo de cor (que controla como as imagens são afetadas pela cor atual).

source: The string data to write to the file.
pt_br: O string de dados a ser escritos no arquivo.

source: The red color component.
pt_br: O componente de cor vermelha.

source: * [[love.graphics.pop]]
pt_br: * [[love.graphics.pop (Português)|love.graphics.pop]]

source: Drawing of shapes and images, management of screen geometry.
pt_br: Desenho de formas e imagens, administração da geometria da tela.

source: * [[ ParticleSystem]]
pt_br: * [[ ParticleSystem (Português)|SistemaDePartículas]]

source: By default the coordinate system in LÖVE corresponds to the display pixels in horizontal and vertical directions one-to-one, and the x-axis increases towards the right while the y-axis increases downwards.
pt_br: Por padrão, o sistema de coordenadas do LÖVE corresponde aos pixels da tela nas direções horizontal e vertical, na proporção de um para um, e o eixo x cresce para a direita, enquanto o eixo y cresce para baixo.

source: Examples
pt_br: Exemplos

source: is_dir
pt_br: eh_dir

source: The object is first scaled to dimensions sw × sh.
pt_br: O objeto é primeiro redimensionado para as dimensões ls x as.

source: system = love.graphics.newParticleSystem( image, buffer )
pt_br: sistema = love.graphics.newParticleSystem( imagem, buffer )

source: Shears the coordinate system.
pt_br: Inclina o sistema de coordenadas.

source: Gets the last modification time of a file.
pt_br: Obtém a última data de modificação de um arquivo.

source: The amount of green.
pt_br: A quantidade de verde.

source: Use [[love.graphics.getSystemLimit]] to check.
pt_br: Use [[love.graphics.getSystemLimit (Português)|love.graphics.getSystemLimit]] para verificar.

source: The encoded data to decode into a font.
pt_br: O dado codificado a ser decodificado numa fonte.

source: A new Canvas with specified width and height.
pt_br: Uma nova Pintura com largura e altura especificadas.

source: mixed
pt_br: misto

source: name, version, vendor, device = love.graphics.getRendererInfo( )
pt_br: nome, versao, fornecedor, aparelho = love.graphics.getRendererInfo( )

source: [[love.graphics.print]] and [[love.graphics.printf]] both suppport UTF-8 encoding.
pt_br: Ambos [[love.graphics.print (Português)|love.graphics.print]] e [[love.graphics.printf (Português)|love.graphics.printf]] suportam codificação UTF-8.

source: Quitting a game in 0.8.0
pt_br: Saindo de um jogo no 0.8.0

source: Gets the system-dependent maximum value for a love.graphics feature.
pt_br: Obtém o valor máximo para um recurso do love.graphics, dependendo do sistema.

source: anisotropy (1)
pt_br: anisotropia (1)

source: size
pt_br: tamanho

source: Check whether something is a file.
pt_br: Verifica se algo é um arquivo.

source: A canvas to texture the quad with.
pt_br: Uma pintura para texturizar o quad.

source: The position of the bottom right corner along x-axis.
pt_br: A posição do canto inferior direito no eixo x.

source: Use [[love.graphics.setLineWidth]] and [[love.graphics.setLineStyle]]
pt_br: Use [[love.graphics.setLineWidth (Português)|love.graphics.setLineWidth]] e [[love.graphics.setLineStyle (Português)|love.graphics.setLineStyle]]

source: The amount of blue.
pt_br: A quantidade de azul.

source: The folder or zip file in the game's save directory which is currently mounted.
pt_br: A pasta ou arquivo zip no diretório de escrita do jogo, atualmente montado(a).

source: The error string, if an error occurred.
pt_br: O string de erro, caso tenha ocorrido um erro.

source: -- Assuming content.zip exists in the game's save directory and contains a file called 'myimage.png'. love.filesystem.mount("content.zip", "content") assert(love.filesystem.exists("content/myimage.png")) love.filesystem.unmount("content.zip") assert(not love.filesystem.exists("content/myimage.png"))
pt_br: -- Supondo que conteúdo.zip exista no diretório de escrita do jogo e contenha um arquivo chamado "minhaimagem.png". love.filesystem.mount("conteúdo.zip", "conteúdo") assert(love.filesystem.exists("conteúdo/minhaimagem.png")) love.filesystem.unmount("conteúdo.zip") assert(not love.filesystem.exists("conteúdo/minhaimagem.png"))

source: Creates a new framebuffer object for offscreen rendering.
pt_br: Cria um novo objeto framebuffer para renderização fora da tela.

source: The name (and path) of the file.
pt_br: O nome (e caminho) do arquivo.

source: It has been renamed from [[love.graphics.setDefaultImageFilter]]
pt_br: Foi renomeado, antes era [[love.graphics.setDefaultImageFilter (Português)|love.graphics.setDefaultImageFilter]]

source: * [[ Font]]
pt_br: * [[ Font (Português)|Fonte]]

source: Use newFont to draw a custom styled text
pt_br: Usar newFont para desenhar um texto com estilo personalizado

source: Draw two lines of text, one scaled and one normal, using [[love.graphics.scale]].
pt_br: Desenhar duas linhas de texto, uma redimensionada e uma normal, usando [[love.graphics.scale (Português)|love.graphics.scale]].

source: re-enables drawing to the screen.
pt_br: reabilita o desenho na tela.

source: It has been renamed from [[love.graphics.setPixelEffect]]
pt_br: Foi renomeado, antes era [[love.graphics.setPixelEffect (Português)|love.graphics.setPixelEffect]]

source: The x-component of the top-left point of the box.
pt_br: O componente x do ponto superior esquerdo da área.

source: Origin offset (x-axis).
pt_br: Deslocamento da origem (eixo x).

source: The quit event is a signal for the event handler to close LÖVE.
pt_br: O evento quit é um sinal para o manipulador de eventos fechar o LÖVE.

source: The arc is drawn from angle1 to angle2 in [https://en.wikipedia.org/wiki/Radian radians].
pt_br: O arco é desenhado do angulo1 até o angulo2 em [https://en.wikipedia.org/wiki/Radian radianos].

source: Like [[love.event.poll]]() , but blocks until there is an event in the queue.
pt_br: Como [[love.event.poll (Português)|love.event.poll]]() , mas bloqueia a execução até existir um evento na fila.

source: Maximum amount of Anisotropic Filtering used.
pt_br: Quantidade máxima de Filtragem Anisotrópica usada.

source: See the example in [[love.run]] for a typical use of this function.
pt_br: Veja o exemplo em [[love.run (Português)|love.run]] de um uso típico dessa função.

source: local ok, chunk, result ok, chunk = pcall( love.filesystem.load, name ) -- load the chunk safely if not ok then print('The following error happend: ' .. tostring(chunk)) else ok, result = pcall(chunk) -- execute the chunk safely if not ok then -- will be false if there is an error print('The following error happened: ' .. tostring(result)) else print('The result of loading is: ' .. tostring(result)) end end
pt_br: local ok, bloco, resultado ok, bloco = pcall( love.filesystem.load, nome ) -- carrega o bloco com segurança if not ok then print('O seguinte erro aconteceu: ' .. tostring(bloco)) else ok, resultado = pcall(bloco) -- executa o bloco com segurança if not ok then -- será falso se houver um erro print('O seguinte erro aconteceu: ' .. tostring(resultado)) else print('O resultado do carregamento é: ' .. tostring(resultado)) end end

source: Radius of the arc.
pt_br: O raio do arco.

source: Not all computers which support Canvases will support multiple render targets.
pt_br: Nem todos computadores que suportam Pinturas suportam alvos de renderização múltiplos.

source: function love.load() -- create canvas canvas = love.graphics.newCanvas() -- direct drawing operations to the canvas love.graphics.setCanvas(canvas) -- draw colored square to canvas love.graphics.setColor(230,240,120) love.graphics.rectangle('fill',0,0,100,100) -- re-enable drawing to the main screen love.graphics.setCanvas() end function love.draw() -- draw scaled canvas to screen love.graphics.setColor(255,255,255) love.graphics.draw(canvas, 200,100, 0, .5,.5) end
pt_br: function love.load() -- criar pintura pintura = love.graphics.newCanvas() -- direcionar operações de desenho para a pintura love.graphics.setCanvas(pintura) -- desenhar quadrado colorido na pintura love.graphics.setColor(230,240,120) love.graphics.rectangle('fill',0,0,100,100) -- reabilitar desenho na tela principal love.graphics.setCanvas() end function love.draw() -- desenhar pintura redimensionada na tela love.graphics.setColor(255,255,255) love.graphics.draw(pintura, 200,100, 0, .5,.5) end

source: Creates and draws a Mesh identical to a normal drawn image but with different colors at each corner
pt_br: Cria e desenha uma Malha idêntica a uma imagem desenhada normalmente, mas com cores diferentes em cada canto

source: Notes
pt_br: Notas

source: spriteBatch = love.graphics.newSpriteBatch( image, size )
pt_br: loteDeSprites = love.graphics.newSpriteBatch( imagem, tamanho )

source: modtime
pt_br: horamod

source: When called with "a/b" it creates both "a" and "a/b", if they don't exist already.
pt_br: Quando invocado com "a/b", cria tanto "a" quanto "a/b", se eles não existirem.

source: love.graphics.setColor( red, green, blue, alpha )
pt_br: love.graphics.setColor( vermelho, verde, azul, alfa )

source: Gets the blending mode.
pt_br: Obtém o modo de mistura.

source: The version of the renderer with some extra driver-dependent version info, e.g. "2.1 INTEL-8.10.44".
pt_br: A versão do renderizador com algumas informações extra sobre a versão, dependendo do driver, por exemplo "2.1 INTEL-8.10.44".

source: Will return 2, when called like this:
pt_br: Irá retornar 2 quando chamado assim:

source: The varying keyword can be used to set a value in the vertex shader and have it interpolated in between vertices and passed down to the pixel shader.
pt_br: A palavra-chave varying (variante) pode ser usada para definir um valor no shader de vértice e fazer com que seja interpolado entre vértices e passado adiante para o shader de pixel.

source: In order to execute the chunk, you have to put () behind it.
pt_br: Para executar esse bloco, é necessário colocar () depois dele.

source: * [[ Mesh]]
pt_br: * [[ Mesh (Português)|Malha]]

source: This function is used when writing your own [[love.run | love.run]] function.
pt_br: Esta função é usada quando você está escrevendo sua própria função [[love.run (Português)| love.run]].

source: The filepath to the image file.
pt_br: O caminho para o arquivo de imagem.

source: If the file existed already, it will be completely replaced by the new contents.
pt_br: Se o arquivo já existia, será totalmente substituído pelo conteúdo novo.

source: love.graphics.setBackgroundColor( red, green, blue, alpha )
pt_br: love.graphics.setBackgroundColor( vermelho, verde, azul, alfa )

source: canvas = love.graphics.getCanvas( )
pt_br: pintura = love.graphics.getCanvas( )

source: If [[love.graphics.isSupported|love.graphics.isSupported("multicanvas")]] returns true, at least 4 simultaneously active canvases are supported.
pt_br: Se [[love.graphics.isSupported (Português)|love.graphics.isSupported("multicanvas")]] retornar verdadeiro, pelo menos 4 pinturas ativas simultâneas são suportadas.

source: None.
pt_br: Nenhum.

source: The image data of the screenshot.
pt_br: O dado de imagem da captura.

source: A Shader object for use in drawing operations.
pt_br: Um objeto Shader usado em operações de desenho.

source: font
pt_br: fonte

source: chunk
pt_br: bloco

source: Two ways of drawing the same triangle
pt_br: Dois modos de desenhar o mesmo triângulo
